In [53]:
import pandas as pd

In [54]:
Details : pd.DataFrame = pd.read_excel("Details.xlsx")
Details.head(2)

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI

In [55]:
Details.shape

(1500, 7)

In [56]:
Orders : pd.DataFrame = pd.read_excel("Orders.xlsx")
Orders.head(2)

  Order ID           Order Date CustomerName          State     City
0  B-26055  2018-10-03 00:00:00    Harivansh  Uttar Pradesh  Mathura
1  B-25993  2018-03-02 00:00:00       Madhav          Delhi    Delhi

In [57]:
Orders.shape

(500, 5)

In [58]:
data_set : pd.DataFrame = pd.merge(Details,Orders,how="outer")

data_set.head(2)

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode,Order Date,CustomerName,State,City
0,B-25601,80,-56,4,Electronics,Electronic Games,UPI,2018-01-04 00:00:00,Bharat,Gujarat,Ahmedabad
1,B-25601,66,-12,5,Clothing,Stole,UPI,2018-01-04 00:00:00,Bharat,Gujarat,Ahmedabad

In [59]:
data_set.rename(columns={"PaymentMode" : "Payment Mode"},inplace=True)
data_set.rename(columns={"CustomerName" : "Customer Name"},inplace=True)

In [60]:
data_set.head(2)

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,Payment Mode,Order Date,Customer Name,State,City
0,B-25601,80,-56,4,Electronics,Electronic Games,UPI,2018-01-04 00:00:00,Bharat,Gujarat,Ahmedabad
1,B-25601,66,-12,5,Clothing,Stole,UPI,2018-01-04 00:00:00,Bharat,Gujarat,Ahmedabad

In [61]:
data_set['Order Date'] = pd.to_datetime(data_set['Order Date'])

In [62]:
data_set.head(1)

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,Payment Mode,Order Date,Customer Name,State,City
0,B-25601,80,-56,4,Electronics,Electronic Games,UPI,2018-01-04,Bharat,Gujarat,Ahmedabad

In [63]:
data_set['Order Year'] = data_set['Order Date'].dt.year

In [64]:
data_set['Order Year'] = data_set['Order Year'].astype("int64")

In [65]:
data_set['Order Year'].head(1)

0    2018
Name: Order Year, dtype: int64

In [66]:
data_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order ID       1500 non-null   object
 1   Amount         1500 non-null   int64
 2   Profit         1500 non-null   int64
 3   Quantity       1500 non-null   int64
 4   Category       1500 non-null   object
 5   Sub-Category   1500 non-null   object
 6   Payment Mode   1500 non-null   object
 7   Order Date     1500 non-null   datetime64[ns]
 8   Customer Name  1500 non-null   object
 9   State          1500 non-null   object
 10  City           1500 non-null   object
 11  Order Year     1500 non-null   int64
dtypes: datetime64[ns](1), int64(4), object(7)
memory usage: 140.8+ KB

In [67]:
data_set.shape

(1500, 12)

In [68]:
data_set.isnull().sum().sum()

0

In [69]:
data_set.duplicated().sum()

0

## Cleaned

In [70]:
data_set.head(4)

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,Payment Mode,Order Date,Customer Name,State,City,Order Year
0,B-25601,80,-56,4,Electronics,Electronic Games,UPI,2018-01-04,Bharat,Gujarat,Ahmedabad,2018
1,B-25601,66,-12,5,Clothing,Stole,UPI,2018-01-04,Bharat,Gujarat,Ahmedabad,2018
2,B-25601,1275,1148,7,Furniture,Bookcases,EMI,2018-01-04,Bharat,Gujarat,Ahmedabad,2018
3,B-25601,8,-2,3,Clothing,Hankerchief,Credit Card,2018-01-04,Bharat,Gujarat,Ahmedabad,2018

## Save in a New excel file

In [73]:
data_set.to_excel("Cleaned.xlsx",index=False)